# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'
tap 'franklouwers/franklouwers'
tap 'kreuzwerker/taps'
tap 'azure/kubelogin'
tap 'bufbuild/buf'
tap 'mike-engel/jwt-cli'
tap 'UpCloudLtd/tap'


# Binaries
#
# cloud provider and IaC / Kubernetes stuff
brew 'awscli' # AWS
brew 'terraform'
brew 'kubectx'
brew 'k9s' # kuberetes master controller cli
brew 'stern' # multiple "kubectl logs -f" at once
#brew 'kreuzwerker/taps/m1-terraform-provider-helper' # helper for terraform for modules than don't have an arm64 mac component yet
brew 'ansible'
brew 'ansible-lint'
brew 'azure/kubelogin/kubelogin'
brew 'azure-cli'
brew 'doctl' # digital ocean
brew 'upcloud-cli' #UpCloud


# format / syntax / text
brew 'yamlfmt' # yaml formatter
brew 'bat' # "cat" on steroids
brew 'glow' # for md files
brew 'lesspipe'
brew 'watch'
brew 'jq'
brew 'yq'
brew 'pwgen'
brew 'recode'
brew 'ripgrep' # faster grep
brew 'fzf'
brew 'coreutils' # gnu coreutils
brew 'fd' # better find, my noevim setup uses this
brew 'oxide' # better z, which is a better cd

# code formatters
brew 'prettier' # maybe move to npm install?
brew 'black'
brew 'stylua' # lua
brew 'flake8' # python
brew 'google-java-format' # java

# dev tools
brew 'git'
brew 'git-lfs'
brew 'svn' # I know, I know. But cask `font-source-code-pro` seems to require this!?
brew 'gh' # official github tools
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20

# dev - language specific
brew 'go'
brew 'gopls'
brew 'go-bindata'
brew 'luajit' # fast lua should be fast
brew 'luarocks' # lua packages
brew 'java' # used to be a cask

# neovim and co
brew 'neovim' # vim but neo
brew 'lazygit' # git for neovim


# other
brew 'deno' # JS runtime, vim plugin 'peek.nvim' needs this
brew 'ipinfo-cli' # ipinfo
#brew 'gnupg2' # doesn't this come with GPG tools?
#brew 'grep'
#brew 'httpie'
#brew 'procmail' # because it includes lockfile!
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'trash' # Manage the Trash bin
#brew 'tree' # List directories in a tree structure
brew 'sipcalc'
brew 'mtr'
brew 'csshx'
brew 'telnet'
brew 'nmap'
brew 'p7zip'
brew 'ghostscript'
brew 'imagemagick'
brew 'exercism' #exercism.io companion app
brew 'hyperfine' # cli benchmark tool
brew 'pgcli' # good postgres cli client
brew 'wget' # yeah, can't get rid of this one yet

brew 'asdf' # version management

brew 'grep' # gnu grep

brew 'ykman' # cli tool for Yubico Key Manager

brew 'terminal-notifier'  # send apple notifs from the cli
brew 'diff-so-fancy' # so fancy diffs±

brew 'bufbuild/buf/buf'

# zshzsh
brew 'zsh'
brew 'zplug'
brew 'zsh-completions'
brew 'zsh-syntax-highlighting'
brew 'dockutil'
brew 'marp-cli' # MARP, voor markdown presentaties
brew 'mike-engel/jwt-cli/jwt-cli' # jwt cli


# Apps
cask 'session-manager-plugin' # AWS ssm
cask 'alfred'
cask '1Password' # you know, for passwords
cask 'keepingyouawake'
cask 'discord'
cask 'dropbox'
cask 'calibre'
cask 'charles'
cask 'handbrake'
cask 'spotify'
cask 'tripmode'
cask 'tunnelblick'
cask 'adguard'
cask 'hazel'
#cask 'grammarly'
cask 'backblaze'
cask 'firefox'
#cask 'github'
#cask 'google-backup-and-sync'
cask 'google-chrome'
cask 'gpg-suite'
#cask 'sublime-text'
#cask 'tableplus'
#cask 'there' # not updated anymore. Replaced by 'Clocker'
#cask 'tor-browser'
#cask 'transmit'
#cask 'dropshare'
cask 'iterm2'
#cask 'alacritty' # terminal 
#cask 'kitty' #terminal
cask 'orbstack' # better docker desktop
cask 'swiftbar' # custom entries in the menubar
cask 'mark-text' # markdown, actually good
cask 'deepl' # translations
cask "hiddenbar" # hide menu bar
#cask 'muzzle'
#cask 'microsoft-edge'
#cask 'vanilla' # hide menu bar icons
#cask 'lunar' # contrast and sound on external displays
#cask 'desktoppr' # easy set backgrounds
# cask 'microsoft-teams' # not bothering untill the multi-tenant version comes out
#cask 'transmit' # transmit 5, sftp client
cask 'rar' # compression


#cask 'capture-one' # doesn't exist anymore

# Fonts
cask 'font-lato'
cask 'font-source-code-pro'
cask 'font-sauce-code-pro-nerd-font'
cask 'font-inter'
cask 'font-mullish'
#cask 'font-source-sans-pro'
#cask 'font-source-serif-pro'
#cask 'karabiner-elements'
cask 'abbyy-finereader-pdf'
cask 'eid-be'
cask 'eid-be-viewer'
cask 'robo-3t'
cask 'rectangle'

cask '1password-cli'
cask 'google-cloud-sdk'
cask 'google-drive'
cask 'microsoft-office'
cask 'visual-studio-code'

#cask 'dbngin' # multiple database engine manager
cask 'imageoptim' # image optimizer (for web and other)

cask 'zoom' # you know, for zoom

cask 'notion' # notion.so

cask 'openvpn-connect' # openvpn connect
cask 'telegram' # telegram messaging

#cask 'cask-drivers/yubico-yubikey-manager' # Yubico manager



# Quicklook
#cask 'qlcolorcode'
#cask 'qlmarkdown'
#cask 'quicklook-json'
#cask 'quicklook-csv'
#cask 'qlstephen'

cask 'slack'
#cask 'pdf-expert'

cask 'adobe-digital-editions' # ePUB protected by Adobe DRM
### Note: requires rosetta2!

cask 'camo-studio' # use iphone as webcam

cask 'ransomwhere' # generic ransomware activity detection. https://objective-see.com/products/ransomwhere.html
# requires rosetta!
cask 'knockknock' # who there? https://objective-see.com/products/knockknock.html
cask 'blockblock' # monitor persistent locations and un-notorized code

cask 'cleanshot' # nice screenshots and editing

cask 'clockify' # time tracker
#cask 'clocker' # time zone aware clock in the menu bar

#cask 'logi-options-plus' #for logitech keyboard stuff - GARBAGE. Don't use anymore ...
cask 'nordvpn' # vpn
cask 'openvpn-connect' # vpn

# Mac App Store
#mas 'Keynote'
#mas 'Tweetbot'
#mas 'Microsoft Remote Desktop 10'
##mas 'Tyme2'
#mas 'ScanSnap Cloud'
#mas 'Pages'
#mas 'Numbers'
#mas 'Clocker'
#mas 'SimpleMind Lite'
#mas 'WireGuard'
#mas 'Velja'

# not here yet:
#
# cpdf and cpdfsqueeze -> //www.coherentpdf.com/
# https://www.canon-europe.com/support/consumer_products/products/printers/laser/i-sensys_lbp613cdw.html?type=drivers&driverdetailid=tcm:13-1943119&os=macos%2010.15%20%28catalina%29&language=en
# Camo

