tap "azure/kubelogin"
tap "bufbuild/buf"
tap "buo/cask-upgrade"
tap "fairwindsops/tap"
tap "franklouwers/franklouwers"
tap "kreuzwerker/taps"
tap "mike-engel/jwt-cli"
tap "natesales/repo", "https://github.com/natesales/repo"
tap "suzuki-shunsuke/tfmv"
tap "stackitcloud/tap"

## data and general purpose tools
# Archive manager for data compression and backups
cask "rar"
# General-purpose data compression with high compression ratio
brew "xz"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Command-line fuzzy finder written in Go
brew "fzf"
# Interpreter for PostScript and PDF
brew "ghostscript"
# Render markdown on the CLI
brew "glow"
# GNU grep, egrep and fgrep
brew "grep"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Official CLI for the IPinfo IP Address API
brew "ipinfo-cli"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Input filter for the pager less
brew "lesspipe"
# Easily convert Marp Markdown files into static HTML/CSS, PDF, PPT and images
brew "marp-cli"
# 7-Zip (high compression file archiver) implementation
brew "p7zip"
# CLI for Postgres with auto-completion and syntax highlighting
brew "pgcli"
# Convert character set (charsets)
brew "recode"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yq"
# Feature-rich command-line audio/video downloader
brew "yt-dlp"
# Super fast CLI tool to decode and encode JWTs built in Rust
brew "mike-engel/jwt-cli/jwt-cli"


## IaaC: Ansible, tofu and others
# Automate deployment, configuration, and upgrading
brew "ansible"
# Checks ansible playbooks for practices and behaviour
brew "ansible-lint"
# Drop-in replacement for Terraform. Infrastructure as Code Tool
brew "opentofu"
# Tool to build, change, and version infrastructure
brew "terraform"

## Cloud management tools (non-IaaC), including kube tools
# Official Amazon AWS command-line interface
brew "awscli"
# Official Stackit-cli companion
cask "stackitcloud/stackit"
# Bring your existing Azure resources under the management of Terraform
brew "aztfexport"
# Microsoft Azure CLI 2.0
brew "azure-cli"
# Command-line tool for DigitalOcean
brew "doctl"
# Command-line tool to interact with exercism.io
brew "exercism"
# Kubernetes package manager
brew "helm"
# Kubernetes CLI To Manage Your Clusters In Style!
brew "k9s"
# Tool that can switch between kubectl contexts easily and create aliases
brew "kubectx"
# Command-line interface for https://speedtest.net bandwidth tests
brew "speedtest-cli"
# Tail multiple Kubernetes pods & their containers
brew "stern"
# A Kubernetes credential (exec) plugin implementing azure authentication
brew "azure/kubelogin/kubelogin"
# Detect deprecated Kubernetes apiVersions
brew "fairwindsops/tap/pluto"
# Set of tools to manage resources and applications hosted on Google Cloud
cask "gcloud-cli"
# Plugin for AWS CLI to start and end sessions that connect to managed instances
cask "session-manager-plugin"

## dev tools excluding interpreters/compilers, but including language servers
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Python code formatter
brew "black"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Good-lookin' diffs with diff-highlight and more
brew "diff-so-fancy"
# Lint your Python code for style and logical errors
brew "flake8"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Git extension for versioning large files
brew "git-lfs"
# Reformats Java source code to comply with Google Java Style
brew "google-java-format"
# Language server for the Go language
brew "gopls"
# Simple terminal UI for git commands
brew "lazygit"
# Version of the SSL/TLS protocol forked from OpenSSL
brew "libressl"
# Library for USB device access
brew "libusb"
# Package manager for the Lua programming language
brew "luarocks"
# Language Server Protocol for Markdown
brew "marksman"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Package compiler and linker metadata toolkit
brew "pkgconf"
# Code formatter for JavaScript, CSS, JSON, GraphQL, Markdown, YAML
brew "prettier"
# Opinionated Lua code formatter
brew "stylua"
# Terraform Language Server
brew "terraform-ls"
# CLI to rename Terraform resources and generate moved blocks
brew "tfmv"
# Extensible command-line tool to format YAML files
brew "yamlfmt"
# The best way of working with Protocol Buffers.
brew "bufbuild/buf/buf"

## dev tools: compilers / interpreters
# Secure runtime for JavaScript and TypeScript
brew "deno"
# GNU compiler collection
brew "gcc"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Development kit for the Java programming language
brew "openjdk"
# Just-In-Time Compiler (JIT) for the Lua programming language
brew "luajit"
# Powerful, clean, object-oriented scripting language
brew "ruby"
# Safe, concurrent, practical language
brew "rust"

## sysadmin tools
# Provides SOCKS and HTTPS proxy support to SSH
brew "connect"
# Cluster ssh tool for Terminal.app
brew "csshx"
# Improved top (interactive process viewer)
brew "htop"
# Command-line benchmarking tool
brew "hyperfine"
# Modern load testing tool, using Go and JavaScript
brew "k6"
# 'traceroute' and 'ping' in a single tool
brew "mtr"
# Port scanning utility for large networks
brew "nmap"
# Password generator
brew "pwgen"
# Advanced console-based IP subnet calculator
brew "sipcalc"
# SMTP command-line test tool
brew "swaks"
# User interface to the TELNET protocol
brew "telnet"
# Passive hostname, domain, and IP lookup tool
brew "wtfis"
# dns general purpose tool
brew "natesales/repo/q"
# Disk partitioning tool
cask "gdisk"

## mac specific
# Tool for managing dock items
brew "dockutil"
# List USB devices, just like the Linux lsusb command
brew "lsusb"
# Mac App Store command-line interface
brew "mas"
# Send macOS User Notifications from the command-line
brew "terminal-notifier"
# CLI tool that moves files or folder to the trash
brew "trash"

## zsh and co
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Next-generation plugin manager for zsh
brew "zplug"
# UNIX shell (command interpreter)
brew "zsh"
# Additional completion definitions for zsh
brew "zsh-completions"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"

## Casks: data
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Command-line interface for 1Password
cask "1password-cli"
# Scan, OCR, and convert documents to searchable PDFs and other formats
#cask "abbyy-finereader-pdf"
# E-book reader
cask "adobe-digital-editions"
# E-books management software
cask "calibre"
# Screen capturing tool
cask "cleanshot"
# Voice and text chat software
cask "discord"
# Client for the Dropbox cloud storage service
cask "dropbox"
# Fujitsu ScanSnap Scanner software
cask "fujitsu-scansnap-home"
# Client for the Google Drive storage service
cask "google-drive"
# Open-source video transcoder
cask "handbrake-app"
# Tool to optimise images to a smaller size
cask "imageoptim"
# Previewer for Markdown, MultiMarkdown and other text markup languages
cask "marked-app"
# Spreadsheet software
cask "microsoft-excel"
# Presentation software
cask "microsoft-powerpoint"
# Word processor
cask "microsoft-word"
# MQTT explorer
cask "mqtt-explorer"
# Cross-platform MQTT 5.0 Desktop Client
cask "mqttx"
# App to write, plan, collaborate, and get organised
cask "notion"
# Calendar for professionals and teams
cask "notion-calendar"
# Email client integrated with Notion workspace
cask "notion-mail"
# PDF reader, editor and annotator
cask "pdf-expert"
# Team communication and collaboration software
cask "slack"
# Messaging app with a focus on speed and security
cask "telegram"
# Open-source BitTorrent client
cask "transmission"
# Open-source code editor
cask "visual-studio-code"
# Native desktop client for WhatsApp
cask "whatsapp"

## Casks: mac tools
# Application launcher and productivity software
cask "alfred" # sorry apple, but alfred still beats spotlight, even in Tahoe
# Terminal emulator that uses platform-native UI and GPU acceleration
#cask "ghostty"
# Automated organisation
#cask "hazel"
# Terminal emulator as alternative to Apple's Terminal app
#cask "iterm2"
# Menu bar manager
#cask "jordanbaird-ice"
# Tool to prevent the system from going into sleep mode
cask "keepingyouawake"
# Move and resize windows using keyboard shortcuts or snap areas
#cask "rectangle"
# Customise mouse buttons, wheels and cursor speed
cask "steermouse" # yep, steel need this
# Menu bar customization tool
#cask "swiftbar"
# Control your data usage on slow or expensive networks
cask "tripmode"


## Casks: network, security and backup
# Stand alone ad blocker
cask "adguard"
# Data backup and storage service
cask "backblaze"
# Monitors common persistence locations
cask "blockblock"
# Web debugging Proxy application
cask "charles"
# Tool to show what is persistently installed on the computer
cask "knockknock"
# Protect your personal files
cask "ransomwhere"
# Network protocol analyzer
cask "wireshark-app"


## Casks: VPN
# VPN client for secure internet access and private browsing
cask "nordvpn"
# Client program for the OpenVPN Access Server
cask "openvpn-connect"
# Free and open-source OpenVPN client
cask "tunnelblick"

## Casks: AI
# OpenAI's official ChatGPT desktop app
cask "chatgpt"
# Anthropic's official Claude AI desktop app and cli companion
cask "claude"
cask "claude-code"

## Casks: belgian eID
cask "eid-be"
cask "eid-be-viewer"

## Casks: browsers
# Web browser
cask "firefox"
# Web browser
cask "google-chrome"

## Casks: remote management, kube and docker
# Kubernetes IDE
cask "lens"
# Remote desktop client - deprecated
#cask "microsoft-remote-desktop" - deprecated
# Replacement for Docker Desktop - there are still things `container` can't do
cask "orbstack"
# Virtual machines UI using QEMU
cask "utm"
# Apple's Container thingie
cask "container"

## Fonts
cask "font-inter"
cask "font-lato"
cask "font-meslo-for-powerlevel10k"
cask "font-mulish"
cask "font-open-dyslexic"

## Entertainment
# Music streaming service
cask "spotify"

# Apple store apps
# make sure you're logged in first
# mas "1Password for Safari", id: 1569813296
# mas "Apple Configurator", id: 1037126344
# mas "CrystalFetch", id: 6454431289
# mas "eID-Signer", id: 1407740667
# mas "Keynote", id: 409183694
# mas "Numbers", id: 409203825
# mas "Pages", id: 409201541
# mas "Photomator", id: 1444636541
# mas "SQLPro for MSSQL", id: 828466809
# mas "TestFlight", id: 899247664
# mas "Toggl Track", id: 1291898086
## mas "Velja", id: 1607635845
# mas "Xcode", id: 497799835
# mas "Xmind", id: 1327661892
