tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'
tap 'franklouwers/franklouwers'
tap 'kreuzwerker/taps'
tap 'azure/kubelogin'
tap 'bufbuild/buf'
tap 'mike-engel/jwt-cli'
tap 'UpCloudLtd/tap'
tap "natesales/repo", "https://github.com/natesales/repo"


# cloud provider and IaC / Kubernetes stuff
brew 'awscli' # AWS
brew 'terraform' # still need this for backwards compatibility
brew "terraform-ls"
brew "terraform-lsp"
brew "opentofu" # new kid on the block
brew 'kubectx'
brew 'k9s' # kuberetes master controller cli
brew 'stern' # multiple "kubectl logs -f" at once
brew 'ansible'
brew 'ansible-lint'
brew 'azure/kubelogin/kubelogin'
brew 'azure-cli'
brew 'doctl' # digital ocean

# format / syntax / text
brew 'yamlfmt' # yaml formatter
brew 'bat' # "cat" on steroids
brew 'glow' # for md files
brew 'lesspipe'
brew 'watch'
brew 'jq'
brew "natesales/repo/q" # dns powertool
brew 'yq'
brew 'pwgen'
brew 'recode'
brew 'ripgrep' # faster grep
brew 'fzf'
brew 'coreutils' # gnu coreutils
brew 'fd' # better find, my noevim setup uses this
brew 'oxide' # better z, which is a better cd

# code formatters
brew 'prettier' # maybe move to npm install?
brew 'black' # python
brew 'stylua' # lua
brew 'flake8' # python
brew 'google-java-format' # java

# dev tools
brew 'git'
brew 'git-lfs'
#brew 'svn' # I know, I know. But cask `font-source-code-pro` seems to require this!?
brew 'gh' # official github tools
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20

brew 'tldr' #better man

# dev - language specific
#brew 'go' # -> moved to asdf
#brew 'gopls' # -> moved to asdf
#brew 'go-bindata' # -> moved to asdf
brew 'luajit' # fast lua should be fast
brew 'luarocks' # lua packages
brew 'java' # used to be a cask

# neovim and co
brew 'neovim' # vim but neo
brew 'lazygit' # git for neovim


# other
brew 'deno' # JS runtime, vim plugin 'peek.nvim' needs this
brew 'ipinfo-cli' # ipinfo
brew 'swaks' # mail debuggingk
#brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'trash' # Manage the Trash bin
brew 'sipcalc'
brew 'mtr'
brew 'csshx'
brew 'telnet'
brew 'nmap'
brew 'p7zip' # better zip (includes good encryption)
brew "xz" # encryption
brew 'ghostscript'
brew 'imagemagick'
brew 'exercism' #exercism.io companion app
brew 'hyperfine' # cli benchmark tool
brew 'pgcli' # good postgres cli client
brew 'yt-dpl' #youtubedownload

brew 'asdf' # version management

brew 'grep' # gnu grep

#brew 'ykman' # cli tool for Yubico Key Manager

brew 'terminal-notifier'  # send apple notifs from the cli
brew 'diff-so-fancy' # so fancy diffs±

brew 'bufbuild/buf/buf'
brew "k6" # ab but better (benchmarks)

# zshzsh
brew 'zsh'
brew 'zplug'
brew 'zsh-completions'
brew 'zsh-syntax-highlighting'
brew 'dockutil' # apple Dock
brew 'marp-cli' # MARP, voor markdown presentaties
brew 'mike-engel/jwt-cli/jwt-cli' # jwt cli


# Apps
cask 'session-manager-plugin' # AWS ssm
cask 'alfred'
cask '1Password' # you know, for passwords
cask 'keepingyouawake'
cask 'dropbox'
cask 'calibre'
cask 'charles'
cask 'handbrake'
cask 'spotify'
cask 'tripmode'
cask 'adguard'
cask 'hazel'
cask 'backblaze'
cask 'firefox'
cask 'google-chrome'
#cask 'gpg-suite'
cask 'iterm2'
cask 'orbstack' # better docker desktop
cask 'swiftbar' # custom entries in the menubar
#cask 'mark-text' # markdown, actually good but no longer maintained
#cask 'deepl' # translations (use chatgpt)
cask "hiddenbar" # hide menu bar
cask 'transmission'
cask 'rar' # compression

# Fonts
cask 'font-lato'
cask 'font-meslo-for-powerlevel10k'
cask 'font-inter'
cask 'font-mullish'
cask 'abbyy-finereader-pdf'
cask 'eid-be'
cask 'eid-be-viewer'
cask 'robo-3t'
cask 'rectangle'

cask '1password-cli'
cask 'google-cloud-sdk'
cask 'google-drive'
#cask 'microsoft-office'
cask 'microsoft-word'
cask 'microsoft-excel'
cask 'microsoft-powerpoint'
cask 'microsoft-remote-desktop'
cask 'visual-studio-code'

cask 'fujitsu-scansnap-home' # to connect the scanner directly

cask 'imageoptim' # image optimizer (for web and other)

#cask 'zoom' # you know, for zoom

cask 'notion' # notion.so


# messaging
cask 'telegram' # telegram messaging
cask 'whatsapp'
cask 'discord'

#cask 'cask-drivers/yubico-yubikey-manager' # Yubico manager



# Quicklook
cask 'slack'
#cask 'pdf-expert'

cask 'adobe-digital-editions' # ePUB protected by Adobe DRM

#cask 'camo-studio' # use iphone as webcam

cask 'ransomwhere' # generic ransomware activity detection. https://objective-see.com/products/ransomwhere.html
# requires rosetta!
cask 'knockknock' # who there? https://objective-see.com/products/knockknock.html
cask 'blockblock' # monitor persistent locations and un-notorized code

cask 'cleanshot' # nice screenshots and editing

#cask 'clockify' # time tracker
#cask 'clocker' # time zone aware clock in the menu bar

#cask 'logi-options-plus' #for logitech keyboard stuff - GARBAGE. Don't use anymore ...

cask 'nordvpn' # vpn
cask 'openvpn-connect' # openvpn connect, for testing (use tunnelblick)
cask 'tunnelblick'
cask 'wireshark'

cask 'chatgpt'


# Mac App Store
mas "1Password for Safari", id: 1569813296
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Photomator", id: 1444636541
mas "SQLPro for MSSQL", id: 828466809
mas "TestFlight", id: 899247664
mas "Toggl Track", id: 1291898086
mas "Xmind", id: 1327661892

# not here yet:
#
# cpdf and cpdfsqueeze -> //www.coherentpdf.com/
# https://www.canon-europe.com/support/consumer_products/products/printers/laser/i-sensys_lbp613cdw.html?type=drivers&driverdetailid=tcm:13-1943119&os=macos%2010.15%20%28catalina%29&language=en

# iterm2 color scheme catppuccin-mocha
# mesloNGS-10
